"use strict";

function _slicedToArray(arr, i) { return _arrayWithHoles(arr) || _iterableToArrayLimit(arr, i) || _unsupportedIterableToArray(arr, i) || _nonIterableRest(); }

function _nonIterableRest() { throw new TypeError("Invalid attempt to destructure non-iterable instance.\nIn order to be iterable, non-array objects must have a [Symbol.iterator]() method."); }

function _unsupportedIterableToArray(o, minLen) { if (!o) return; if (typeof o === "string") return _arrayLikeToArray(o, minLen); var n = Object.prototype.toString.call(o).slice(8, -1); if (n === "Object" && o.constructor) n = o.constructor.name; if (n === "Map" || n === "Set") return Array.from(o); if (n === "Arguments" || /^(?:Ui|I)nt(?:8|16|32)(?:Clamped)?Array$/.test(n)) return _arrayLikeToArray(o, minLen); }

function _arrayLikeToArray(arr, len) { if (len == null || len > arr.length) len = arr.length; for (var i = 0, arr2 = new Array(len); i < len; i++) { arr2[i] = arr[i]; } return arr2; }

function _iterableToArrayLimit(arr, i) { if (typeof Symbol === "undefined" || !(Symbol.iterator in Object(arr))) return; var _arr = []; var _n = true; var _d = false; var _e = undefined; try { for (var _i = arr[Symbol.iterator](), _s; !(_n = (_s = _i.next()).done); _n = true) { _arr.push(_s.value); if (i && _arr.length === i) break; } } catch (err) { _d = true; _e = err; } finally { try { if (!_n && _i["return"] != null) _i["return"](); } finally { if (_d) throw _e; } } return _arr; }

function _arrayWithHoles(arr) { if (Array.isArray(arr)) return arr; }

var originalArr = ["*", ".", "+", "°", //   "\u0359",
"\u2219", "\u02DF", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " " //   "\u030A",
//   "'",
//   "\u0308",
//   "\u0738",
//   "\u0739",
//   "\u07ED",
//   "\u003A",
];
var elements = {
  star_1: ["              '                        ", " ", "                *       '              ", "          *                            ", "                                       ", "                  .           .        ", "                              ;        ", "          *               - --+- -     ", "                              !        ", "      +                       .        ", "           *           .               ", "                                       ", "                       *      .        ", "                                  +    ", "                     °                 ", "         °                             ", ".                .                     ", "                 .                     ", "                 :      .           *  ", "                 !           .         ", "     *           |        .            ", "                 |_         +          ", "              ,  | `.                  ", "-  -- --- --+-&lt;#&gt;-+- ---  --  -  ", "              `._|_,'                  ", "                 T                     ", "                 |                 +   ", "   +             !                     ", "                 :         .           ", "        .        .       *             "],
  star_2: [" .' .--.   ", "*  * _     ", "*._:##:.-. ", "   ':##   *", "       *  *", "   '--* .' "],
  star_3: [" .' .--.   ", " *  * _     ", "*._:##:.-. ", "   ':##   *", "       *  *", "   '--* .' "],
  star_4: ["       :     ° ", "   .   :   .   ", "     . : .     ", " - - -*.* - - -", "     .*:*.     ", "   .   :   +   ", "       :       ", ".      :       "],
  star_5: ["     :     ", "   . : .   ", "--- *.* ---", "   .*:*.   ", "     :     "],
  star_6: ["  .         .            O   ", "  +         .                ", "            :        +       ", "        .   !   '           *", "           ,|.'              ", " -  -- ---(-O-)--- --  -     ", "          ,`|'`.             ", "  .     ,   !    .       .   ", "            :       :        ", "            .     --+--      ", "  .:        .       !        "],
  star_7: ["   °             .      .             +  ", "            .                    /       ", "        +             O         /        ", "                               /    .    ", "   +                .         *          ", "                                         ", "          /          .                   ", "         /                           |   ", "        /              +           - o - ", "       /          .                  |   ", "      *                                  ", "            .                    *       "],
  star_8: ["    °        .          .-.  ", "        .:'            (   ) ", " _.::'       +          '-'  ", "(_.'               .         "],
  star_9: ["    o              ...                    ", "                      '';:';..   ˟        ", "      .                     :  . .        ", "        :.......               :::.       ", '      .:::"\'":::..   +            ;:.    ', "  .  :'''; ;    ...                :.     ", "    :;.'           .......         .;.;   ", "  .:;:            '' ### ':'        :.    ", " .:;'      +     \"( ##### )\"      .':;  ", " .:;               ' ### '     *   ';\"   ", " ''..               ''';:\"       .':'    ", "  '...                 ::...     :;.'     ", "    ...                  :::..'''...      ", '     ...                    ``"""`        ', "    '''...                          *     ", "      ' ...                               ", "          ...                             ", "             ```.```                      "],
  planet_1: ["+                            ", "                             ", "          *       +          ", "    '                  |     ", '()    .-.,="``"=.    - o -   ', "      '=/_       &#92     |  ", "   *   |  '=._    |          ", "        &#92     `=./`,      ", "     .   '=.__.=' `='      * ", "                      +      ", " O      *        '       .   "],
  planet_2: ["      .--.   .  ", " ____'#   '____ ", "'=============='", "   . '.__.'  .  "],
  planet_3: ["   .======.    ", " .=\\_   _/~=. ", " =~~~\\_/~~~~= ", "|:~~~~~~_/\\_:|", " =_/\\_ |_   = ", " '=   \\~~\\_='", "   '======'    "],
  planet_4: ["    ______    ", " .=~~~~~~~~=. ", ".===()=======.", "=~~~~~~~~~~~~=", "==============", "'=~~~~~~~~~~='", "  '-.____.-'  "],
  planet_5: ["  .#******#.  ", ".##~~~~~~~~##.", "##~~~~~~~~~~##", "#~~~~~~~~~~~~#", "##~~~~~~~~~~##", "'##~~~~~~~~##'", "  '########' *"],
  planet_6: ["  .#****#.  ", ".##~~~~~~##.", "#~~~~~~~~~~#", "#~~~~~~~~~~#", "'##~~~~~~## ", "  '######'  "],
  planet_7: ["  ___  ", ".=   =.", "= o : =", "'=___='"],
  planet_8: ["  ___  ", ".=   =.", "= o : =", "'=___='"],
  planet_9: [" +                                  ", "            ___-----___          () ", "        _,-'           `-._         ", "      ,'.    --.     ``:::.`.       ", "     /          `.            _    *", "    ` `._ ` (`    `-.    ._ __ )    ", '   ;m   ,\'       -##,  ""    " :   ', "  : #   `        m ww =(   '    :   ", "  | `    (_           `       ` |   ", "  |    .            '           /   ", "  : '   `-.__    .            ) :  .", "   `    oO `-'        ::     / ;    ", "   :\\             ,##. '  ' ,' /     ", "    \\              ``   /,-'  /      ", "     ``._    `   __,--'--'_,'       ", "         `-____     ___,-v        . ", "  .       '    -----                "],
  planet_10: ["                    .    ", "       .                 ", "   o                     ", "    .              O     ", "     0     .             ", "                      .  ", "       \\                ", "        \\               ", "         o     .         ", ".         \\             ", "          #\\##\\#      .", "        #  #O##\\###     ", "       #*#  #\\##\\###   ", "       ##*#  #\\##\\##   ", " .      ##*#  #o##\\#    ", "     .     *#  #\\#     .", "                 \\      ", "                  o      ", "()                 \\    ", "                    \\   ", "      .              '   ", "                      0  ", "           *           . "] // planet_10: [
  //   "                              ..,;;,.   ",
  //   "    +                      .:llclloooo' ",
  //   "                        .:llc::llcoo;ld.",
  //   "            .';ccc:cc:clk0ocllc,. :d,:x'",
  //   "          'cll:'.      .';lkk;   ;d;,dc ",
  //   "        .lo:.              .;oo;ld;,dc. ",
  //   "       ,dc.                  .d0o,:d:   ",
  //   "      'dc                   .cd:,od'    ",
  //   "      lo.      ..          ;dl,:Ok'     ",
  //   "     .dc                 ,oo;;oodx'     ",
  //   "     .dl               'lo:;lo,.:x'     ",
  //   "     .xx.           .'ld:,lo:. .oo.     ",
  //   "    ,dxkl.        ,ldo:;lo:.   cx'      ",
  //   "   :x:,x0o.    .;oo:,;ld:.   .ld,       ",
  //   " .cd,;xc':dc'':ol;;ldo:.   .:oc.        ",
  //   " cd,;x:   ,k0dc;cxxc,'.';:ll:.          ",
  //   "'x:'xc..;llc;:looolccccc:,.             ",
  //   ".xc'llccc::col;.                        ",
  //   " ,olccccclc;.                           ",
  //   "  .';:;,.                               ",
  // ],

};
var planet_1 = ["       +                                ", "                                         ", "                 *       +               ", "           '                  |          ", '       ()    .-.,="``"=.    - o -        ', "             '=/_       &#92     |       ", "          *   |  '=._    |               ", "               &#92     `=./`,        '  ", "            .   '=.__.=' `='      *      ", "   +                         +           ", "        O      *        '       .        "];
var planet_2 = ["   °           .          .--.   .   .  ", "                     ____'#   '____     ", "     .              '=============='  + ", "             .         . '.__.'  .   .  "];
var planet_3 = ["   *            .======.                ", "    .         .=\\_   _/~=.   *         ", "              =~~~\\_/~~~~=      .      ", "        .    |:~~~~~~_/\\_:|       .    ", " +            =_/\\_ |_   =             ", "              '=   \\~~\\_='   .     °  ", "          .     '======'                "];
var planet_4 = ["     ______     °           .          ", "  .=~~~~~~~~=.                         ", " .===()=======.     .            °     ", " =~~~~~~~~~~~~=                    .   ", " ==============                        ", " '=~~~~~~~~~~='           *            ", "   '-.____.-'    .     +          .    "];
var planet_5 = ["  .#******#.    .      +             .   ", ".##~~~~~~~~##.                           ", "##~~~~~~~~~~##                           ", "#~~~~~~~~~~~~#                           ", "##~~~~~~~~~~##       °                 * ", "'##~~~~~~~~##'                  +        ", "  '########' *            *            * "];
var planet_6 = ["     *   .           .     .#****#.  * ", "                         .##~~~~~~##.  ", "       .    *      *     #~~~~~~~~~~#  ", " *            .         .#~~~~~~~~~~#  ", "                         '##~~~~~~##   ", "       .                   '######'  * "];
var planet_7 = ["  .     *           ___   .          *  ", "                  .=   =.               ", "        .    .    = o : =  .            ", "  .               '=___='         *     "];
var planet_8 = ["    ___   .          *   .            * ", "  .=   =.        *     . .              ", "  = o : =  .                            ", "  '=___='           :      .      *   . "];
var planet_9 = ["  .                             ___   . ", "               *        :     .=   =.   ", "        .    .                = o : =   ", "                              '=___='   "];
var planet_10 = ["                              ..,;;,.   ", "    +                      .:llclloooo' ", "                        .:llc::llcoo;ld.", "            .';ccc:cc:clk0ocllc,. :d,:x'", "          'cll:'.      .';lkk;   ;d;,dc ", "        .lo:.              .;oo;ld;,dc. ", "       ,dc.                  .d0o,:d:   ", "      'dc                   .cd:,od'    ", "      lo.      ..          ;dl,:Ok'     ", "     .dc                 ,oo;;oodx'     ", "     .dl               'lo:;lo,.:x'     ", "     .xx.           .'ld:,lo:. .oo.     ", "    ,dxkl.        ,ldo:;lo:.   cx'      ", "   :x:,x0o.    .;oo:,;ld:.   .ld,       ", " .cd,;xc':dc'':ol;;ldo:.   .:oc.        ", " cd,;x:   ,k0dc;cxxc,'.';:ll:.          ", "'x:'xc..;llc;:looolccccc:,.             ", ".xc'llccc::col;.                        ", " ,olccccclc;.                           ", "  .';:;,.                               "];
var planet_11 = [" +                                        ", "            ___-----___          ()       ", "        _,-'           `-._               ", "      ,'.    --.     ``:::.`.             ", "     /          `.            _    *      ", "    ` `._ ` (`    `-.    ._ __ )          ", '   ;m   ,\'       -##,  ""    " :       . ', "  : #   `        m ww =(   '    :         ", "  | `    (_           `       ` |         ", "  |    .            '           /         ", "  : '   `-.__    .            ) :  .      ", "   `    oO `-'        ::     / ;          ", "   :\\             ,##. '  ' ,' /           ", "    \\              ``   /,-'  /            ", "     ``._    `   __,--'--'_,'         *   ", "         `-____     ___,-v        .       ", "  .       '    -----                      "];
var planet_12 = ["  *                      .                  ", "  .         .                  *            ", "        o                                   ", "         .              O                   ", "          0     .                           ", "                           .           +    ", " .          \\                              ", "             \\                             ", "              o     .                       ", "     .         \\                           ", "               #\\##\\#      .              ", "             #  #O##\\###                   ", "   .        #*#  #\\##\\###                 ", "            ##*#  #\\##\\##            *    ", "      .      ##*#  #o##\\#                  ", "          .     *#  #\\#     .              ", "                      \\                    ", "                       o                    ", "     ()                 \\                  ", "                         \\                 ", "           .              '         +       ", "                           0                ", "                *           .               "]; //  Получить ширину и высоту необходимого контента

var width = window.innerWidth;
var height = window.innerHeight; // Количество символов в одной строке (5.5 ширина одного символа)

var line = Math.floor(width / 5.5); // Количество строк на екране (11 высота одного символа)

var numOfLines = Math.floor(height / 11); // --- Функция для получения рандомного символа с масива --- //

function getRandomStar(arr) {
  return arr[Math.floor(Math.random() * arr.length)];
} // --- Функция для определения должен ли быть отрисовать элемент --- //


function shoudDrawElem() {
  var shoudDraw = false;
  var chance = Math.floor(Math.random() * 25);

  if (chance == 1) {
    shoudDraw = true;
  }

  return shoudDraw;
} // --- Функция для заполнения контейнера контентом --- //


function drawStars() {
  var arrOfStars = [];
  var j = 0;

  while (j <= numOfLines) {
    // заполнить все строки
    for (var i = 0; i < line; i++) {
      // заполнить одну строку
      arrOfStars.push(getRandomStar(originalArr));
    }

    arrOfStars.push("\n");
    j++;
  }

  return arrOfStars.join("");
} // --- Функция для полечений позиции элемента по Y --- //


function getYPos() {
  return Math.floor(Math.random() * height);
} // --- Функция для полечений позиции элемента по X --- //


function getXPos() {
  return Math.floor(Math.random() * width);
} // --- Функция для отрисрвки элемента в случийним месте --- //


function drawElem(data) {
  var elem = null;

  if (shoudDrawElem()) {
    elem = document.createElement("pre");
    elem.setAttribute("class", "element");
    elem.setAttribute("style", "top: ".concat(getYPos(), "px; left: ").concat(getXPos(), "px"));
    elem.innerHTML = data.join("\n");
  }

  return elem;
}

$(document).ready(function () {
  var idrag = jQuery.infinitedrag("#wall", {}, {
    width: width,
    height: height,
    start_col: 0,
    start_row: 0,
    oncreate: function oncreate($element, col, row) {
      $element.text(drawStars());

      for (var _i = 0, _Object$entries = Object.entries(elements); _i < _Object$entries.length; _i++) {
        var _Object$entries$_i = _slicedToArray(_Object$entries[_i], 2),
            key = _Object$entries$_i[0],
            value = _Object$entries$_i[1];

        $element.append(drawElem(value));
      }
    }
  });
});